{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "filters": 32, "name": "conv2d_1", "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "name": "conv2d_2", "kernel_size": [3, 3], "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "name": "dense_1", "units": 128, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "name": "dense_2", "units": 10, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}], "keras_version": "2.0.8", "backend": "tensorflow"}